/* ************************************************************************ */
/*
7.20结构拆分完成
7.21做出接口框架
7.22维护接口整理特殊行棋

炸弹分值细化

dfs（棋子，起点，终点，地图）
返回值是最快多少步
-1为无法到达
 cbm 拓展 
 pinggu有问题，太冗杂
 dfs里的嵌套没生成对应的棋

 ProTa和Fresh头文件里面的函数重了


spe1		16.17级代码
spe2		邹宇鹏	Q	2827280689
spe3		蒋明沅	Q	1076479923
spe4		佟凯	Q	904674468
spe5		佟凯	Q	904674468
spe6		何雨泊	Q	2861392429
spe7		杨嘉维	Q	2058139014
spe8		陆帅	Q	1658324114
spe9		吴沛忆	Q	1286956335
*/
/* ************************************************************************ */