from 全局变量辅助 import *
import  logging
logging.basicConfig(level=logging.INFO)

def 概率表初始化():
    敌方棋子集合 = val('敌方棋子集合')
    棋子编码转化表 = val('棋子编码转化表')
    棋种概率表 = val('棋种概率表')
    原始概率表 = {
      #ID  司令 ,军长  ,师长 ,旅长  ,团长 ,营长 ,连长  ,排长 ,工兵 ,地雷  ,炸弹 ,军旗
        0:[100  ,100  ,250  ,500  ,500  ,700  ,2000 ,2100 ,400  ,3250 ,100  ,0    ],
        1:[0    ,0    ,0    ,0    ,0    ,0    ,0    ,3000 ,0    ,2000 ,0    ,5000 ],
        2:[100  ,100  ,250  ,500  ,500  ,700  ,2000 ,2100 ,200  ,3250 ,100  ,0    ],
        3:[0    ,0    ,0    ,0    ,0    ,0    ,0    ,3000 ,0    ,2000 ,0    ,5000 ],
        4:[100  ,100  ,250  ,500  ,500  ,700  ,2000 ,2100 ,400  ,3250 ,100  ,0    ],
        10:[500  ,500  ,850  ,700  ,600  ,500  ,600  ,500  ,1000 ,3250 ,1000 ,0    ],
        11:[400  ,400  ,850  ,700  ,600  ,500  ,800  ,600  ,1000 ,3250 ,900  ,0    ],
        12:[400  ,400  ,850  ,700  ,600  ,500  ,800  ,600  ,1000 ,3250 ,900  ,0    ],
        13:[400  ,400  ,850  ,700  ,600  ,500  ,800  ,600  ,1000 ,3250 ,900  ,0    ],
        14:[500  ,500  ,850  ,700  ,600  ,500  ,600  ,500  ,1000 ,3250 ,1000 ,0    ],
        20:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        22:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        24:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        30:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        31:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        33:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        34:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        40:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        42:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        44:[500  ,500  ,1000 ,1000 ,1000 ,1500 ,500  ,500  ,2000 ,0    ,1500 ,0    ],
        50:[500  ,500  ,1000 ,1000 ,1200 ,2800 ,1500 ,1500 ,0    ,0    ,0    ,0    ],
        51:[500  ,500  ,1000 ,1000 ,1000 ,1000 ,1500 ,1500 ,2000 ,0    ,0    ,0    ],
        52:[500  ,500  ,1000 ,1000 ,1100 ,2800 ,1600 ,1500 ,0    ,0    ,0    ,0    ],
        53:[500  ,500  ,1000 ,1000 ,1000 ,1000 ,1500 ,1500 ,2000 ,0    ,0    ,0    ],
        54:[500  ,500  ,1000 ,1000 ,1200 ,2800 ,1500 ,1500 ,0    ,0    ,0    ,0    ],
    }
    #将原始概率表注入棋子概率表和棋种概率表
    for chessID in 原始概率表:
        敌方棋子 = 敌方棋子集合[chessID]
        i = 0
        for 棋种 in 棋子编码转化表:
            棋种分 = 原始概率表[chessID][i]
            敌方棋子.概率[棋种] = 棋种分
            if 棋种分 == 10000:
                敌方棋子.是啥 = 棋种
            棋种概率表[棋种][chessID] = 棋种分
            i+=1
        敌方棋子集合[chessID] = 敌方棋子

    val('敌方棋子集合',敌方棋子集合)
    val('棋种概率表',棋种概率表)
            
def 概率表log():
    敌方棋子集合 = val('敌方棋子集合')
    棋种概率表 = val('棋种概率表')

    print('棋子概率表:{')
    for chessID in 敌方棋子集合:
        敌方棋子 = 敌方棋子集合[chessID]
        print(chessID,end = ':{')
        for 棋种 in 敌方棋子.概率:
            print(棋种+':'+str('%d' %敌方棋子.概率[棋种]),end = ',')
        print('}')
    print('}')
    print('')

    print('棋种概率表:{')
    for 棋种 in 棋种概率表:
        棋种概率 = 棋种概率表[棋种]
        print(棋种,end=':{')
        for chessID in 棋种概率:
            print(str(chessID)+':'+str('%d' %棋种概率[chessID]),end = ',')
        print('}')
    print('}')
    print('')

def 改变概率表(chessID,棋种,概率分数):
    敌方棋子集合 = val('敌方棋子集合')
    棋种概率表 = val('棋种概率表')
    棋种最大数目表 = val('棋种最大数目表')
    敌方棋子 = 敌方棋子集合[chessID]

    if 敌方棋子.概率[棋种] == 概率分数:
        return

    纵向org = {}
    纵向chgto = {}

    纵向org[棋种] = 棋种最大数目表[棋种]*10000 - 敌方棋子.概率[棋种]
    除了目标概率的原概率分数org = 10000 - 敌方棋子.概率[棋种]
    敌方棋子.概率[棋种] = 概率分数
    剩余可分配概率分数chgto = 10000 - 概率分数
    纵向chgto[棋种] = 棋种最大数目表[棋种]*10000 - 敌方棋子.概率[棋种]

    if 概率分数 == 10000:
        敌方棋子.是啥 = 棋种    
    for 棋种_1 in 敌方棋子.概率: #平均分配棋子的棋种概率，棋种概率分 * chgto/org
        if 棋种_1 != 棋种:       #横向
            纵向org[棋种_1] = 棋种最大数目表[棋种_1]*10000 - 敌方棋子.概率[棋种_1]
            if 敌方棋子.概率[棋种_1]!=10000 and 敌方棋子.概率[棋种_1]!=0:
                敌方棋子.概率[棋种_1] *= 剩余可分配概率分数chgto / 除了目标概率的原概率分数org
            纵向chgto[棋种_1] = 棋种最大数目表[棋种_1]*10000 - 敌方棋子.概率[棋种_1]
        棋种概率表[棋种_1][chessID] = 敌方棋子.概率[棋种_1]
        for chessID_1 in 棋种概率表[棋种_1]: #纵向         
            if chessID_1 != chessID:
                if 棋种概率表[棋种_1][chessID_1]!=10000 and 棋种概率表[棋种_1][chessID_1]!=0:
                    棋种概率表[棋种_1][chessID_1] *= 纵向chgto[棋种_1]/纵向org[棋种_1]
                    敌方棋子集合[chessID_1].概率[棋种_1] = 棋种概率表[棋种_1][chessID_1]
            
            if 棋种概率表[棋种_1][chessID_1] <= 50:#忽视 0.005
                敌方棋子集合[chessID_1].概率[棋种_1] = 0
                棋种概率表[棋种_1][chessID_1] = 0
            elif 棋种概率表[棋种_1][chessID_1] >= 9950:
                敌方棋子集合[chessID_1].概率[棋种_1] = 10000
                棋种概率表[棋种_1][chessID_1] = 10000
                敌方棋子集合[chessID_1].是啥 = 棋种_1


        
    敌方棋子集合[chessID] = 敌方棋子
    val('敌方棋子集合',敌方棋子集合)
    val('棋种概率表',棋种概率表)

def 刷新概率表(起点,终点,结果,己方ID,敌人ID,移动方,棋盘): #棋盘为地图特殊点
    棋种可吃表 = val('棋种可吃表')
    棋种被吃表 = val('棋种被吃表')
    棋种表 = val('棋种表')
    敌方军旗位置 = val('敌方军旗位置')
    敌方司令编号 = val('敌方司令编号')
    #移动 移动状态可能存在于其他结果之间
    if 移动方=='敌人':
        #移动一定不是地雷
        改变概率表(敌人ID,'地雷',0)
        #铁路转弯一定是工兵
        if 棋盘[起点[0]][起点[1]] == 1 and 棋盘[终点[0]][终点[1]] == 1:
            if 起点[0]!=终点[0] and 起点[1]!=终点[1]:
                改变概率表(敌人ID,'工兵',10000)
            
    #吃掉
    if 结果=='吃掉':
        #吃掉一定不是不可吃棋（可被吃棋与同棋）
        不可吃表 = 棋种表-棋种可吃表[己方ID]
        for 棋种 in 不可吃表:
            改变概率表(敌人ID,棋种,0)
        if 移动方=='己方' and 棋盘[终点[0]][终点[1]]==3:
            改变概率表(敌人ID,'军旗',0)
    #被吃
    elif 结果=='被吃':
        #被吃一定不是不可被吃棋（可吃棋与同棋）
        不被吃表 = 棋种表-棋种被吃表[己方ID]
        print('不可吃表：'+str(不被吃表))
        for 棋种 in 不被吃表:
            改变概率表(敌人ID,棋种,0)
    #对死
    elif 结果=='对死':
        
        if 己方ID == '炸弹' and 敌人ID!=敌方司令编号:
            改变概率表(敌人ID,'司令',0)
        if 己方ID == '地雷':
            改变概率表(敌人ID,'炸弹',10000)
        elif 己方ID!='司令':#对死非司令棋一定不是!{炸弹，同棋}
            不是表 = 棋种表 - {'炸弹',己方ID}
            for 棋种 in 不是表:
                改变概率表(敌人ID,棋种,0)
        else:           #对死司令棋一定是炸弹（在对方军旗没有暴漏的情况下，如果是司令则在判断前就会被反馈）
            if  敌人ID!=敌方司令编号:
                改变概率表(敌人ID,'炸弹',10000)
        
        
     